---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.RebarShapeConstraint180DegreeBendRadius
source: html/6cec811a-9a42-7ccd-e0b5-c6b19c188ee6.htm
---
# RebarShapeConstraint180DegreeBendRadius Properties

A choice of rule for measuring the radius.